app/views/points/index.html.erb

SELECT `points`.* FROM `points` ORDER BY `points`.`id` DESC
---
        <td><%= link_to point.id, point -%></td>
        <td><%= link_to (point.point_type.present? ? point.point_type.titleize : "N/A"), point  -%></td>

SELECT  `exams`.* FROM `exams` WHERE `exams`.`point_n_id` = 13 LIMIT 1
SELECT  `exams`.* FROM `exams` WHERE `exams`.`point_po_id` = 15 LIMIT 1
---
            <% when "point_n" %>
              <%= link_to (point.point_n_exams.present? ? point.point_n_exams.id.to_s : "N/A"), point -%>
              <% when "point_a" %>
              <%= link_to (point.point_a_exams.present? ? point.point_a_exams.id.to_s : "N/A"), point -%>

SELECT  `exams`.* FROM `exams` WHERE `exams`.`point_or_id` = 16 LIMIT 1
---
              <% when "point_or" %>
              <%= link_to (point.point_or_exams.present? ? point.point_or_exams.id.to_s : "N/A"), point -%>