app/views/search/index.html.erb

<% if ((@result.present?) && (@result.size > 0)) %>
  <% if ((params[:field_patient].present?) && (params[:field_patient] != '')) %>
---
SELECT `patients`.* FROM `patients` WHERE (date_birth = '1990-01-01')

            <td><%= link_to patient.date_birth.strftime('%d/%m/%Y'), patient -%></td>
            <td><%= link_to (patient.exams.present? ? (link_to patient.exams.count.to_s, patient) : 0), patient -%></td>
---
SELECT COUNT(*) FROM `exams` WHERE `exams`.`patient_id` = 2
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 2

          <td><%= link_to exam.id.to_s, exam %></td>
          <td><%= link_to exam.patient.name, exam if exam.patient.present? %></td>
---
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1