app/views/patients/edit.html.erb

  <tbody>
    <% @patient.exams.each do |exam| %>
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 1