app/views/patients/index.html.erb

SELECT COUNT(*) FROM `exams` WHERE `exams`.`patient_id` = 1
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 1
---
        <td><%= link_to patient.date_birth.strftime('%d/%m/%Y'), patient -%></td>
        <td><%= link_to (patient.exams.present? ? (link_to patient.exams.count.to_s, patient) : 0), patient -%></td>