app/controllers/exams_controller.rb

SELECT `exams`.* FROM `exams` ORDER BY `exams`.`id` DESC
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 1 ORDER BY `exams`.`id` DESC
---
  def index
    @exams = Exam.all.order(id: :desc)
    if params[:patient] && params[:patient] != "" then
     @exams = Exam.all.where(:patient_id => params[:patient]).order(id: :desc)

SELECT `types_exams`.* FROM `types_exams` WHERE `types_exams`.`active` = TRUE ORDER BY `types_exams`.`name` ASC
---
  def show
    @patients = Patient.all.order(name: :asc)
    @types_exams = TypesExam.all.order(name: :asc).where(active: true)

SELECT `patients`.* FROM `patients` ORDER BY `patients`.`name` ASC
SELECT `types_exams`.* FROM `types_exams` WHERE `types_exams`.`active` = TRUE ORDER BY `types_exams`.`name` ASC
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1
---
  def new
    @patients = Patient.all.order(name: :asc)
    @types_exams = TypesExam.all.order(name: :asc).where(active: true)
    if params[:id].present? then
      @patient = Patient.find(params[:id])

SELECT `patients`.* FROM `patients`
SELECT `types_exams`.* FROM `types_exams` WHERE `types_exams`.`active` = TRUE ORDER BY `types_exams`.`name` ASC
---
  def edit
    @patients = Patient.all
    @types_exams = TypesExam.all.order(name: :asc).where(active: true)

INSERT INTO `exams` (`patient_id`, `types_exam_id`, `point_n_id`, `point_a_id`, `point_po_id`, `point_or_id`, `created_at`, `updated_at`) VALUES (2, 1, 17, 18, 19, 20, '2019-06-26 19:56:06', '2019-06-26 19:56:06')
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 1 ORDER BY `exams`.`id` DESC
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 3 LIMIT 1
---
  def create
    @patients = Patient.all.order(name: :asc)
    @types_exams = TypesExam.all.order(name: :asc).where(active: true)
    @exam = Exam.new(exam_params)

    respond_to do |format|
      if @exam.save
        format.js { @exams = @exam.patient.exams.order(id: :desc) }

UPDATE `exams` SET `types_exam_id` = NULL, `point_n_id` = 53, `point_a_id` = 54, `point_po_id` = 55, `point_or_id` = 56, `updated_at` = '2019-06-29 01:09:14' WHERE `exams`.`id` = 7
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 1 ORDER BY `exams`.`id` DESC
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 3 LIMIT 1
---
  def update
    @patients = Patient.all.order(name: :asc)
    @types_exams = TypesExam.all.order(name: :asc).where(active: true)
    respond_to do |format|
      if @exam.update(exam_params)
        format.js { @exams = @exam.patient.exams.order(id: :desc) }

DELETE FROM `exams` WHERE `exams`.`id` = 13
---
  def destroy
    @exam.destroy

SELECT  `exams`.* FROM `exams` WHERE `exams`.`id` = 11 LIMIT 1
---
    def set_exam
      @exam = Exam.find(params[:id])