app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients` ORDER BY `patients`.`name` ASC
---
  def index
    @patients = Patient.all.order(name: :asc)

INSERT INTO `patients` (`name`, `created_at`, `updated_at`, `date_birth`, `slug`) VALUES ('Thomas Cunningham', '2019-06-26 01:09:45', '2019-06-26 01:09:45', '1979-11-02', 'thomas-cunningham')
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

DELETE FROM `patients` WHERE `patients`.`id` = 1
---
  def destroy
    @patient.destroy

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 0 LIMIT 1
---
    def set_patient
      @patient = Patient.friendly.find(params[:id])