app/controllers/points_controller.rb

  def index
    @points = Point.all.order(id: :desc)
---
SELECT `points`.* FROM `points` ORDER BY `points`.`id` DESC

  def create
    @point = Point.new(point_params)

    respond_to do |format|
      if @point.save
---
INSERT INTO `points` (`point_type`, `x`, `y`, `created_at`, `updated_at`) VALUES (2, 37.0, 135.0, '2019-06-24 22:34:30', '2019-06-24 22:34:30')

  def update
    respond_to do |format|
      if @point.update(point_params)
---
UPDATE `points` SET `x` = 999.0, `y` = 999.0, `updated_at` = '2019-06-25 03:23:40' WHERE `points`.`id` = 21

  def destroy
    @point.destroy
---
DELETE FROM `points` WHERE `points`.`id` = 15

    def set_point
      @point = Point.find(params[:id])
---
SELECT  `points`.* FROM `points` WHERE `points`.`id` = 1 LIMIT 1