app/controllers/search_controller.rb

  def index
    @q = params
    if ((@q[:field_patient].present?) && (@q[:field_patient] != '') && (@q[:field_value] != '')) then
      if @q[:field_patient] == 'name' then
        # Name (String)
        @result = Patient.where("lower(#{@q[:field_patient]}) LIKE ?", "%#{@q[:field_value]}%".downcase)
      else
        # Date Birth (Date)
        myDate = Date.parse(@q[:field_value].to_datetime.strftime('%Y-%m-%d')) rescue nil
        @result = Patient.where("#{@q[:field_patient]} = ?", myDate)
      end
    elsif ((@q[:field_exam].present?) && (@q[:field_exam] != '') && (@q[:field_value] != '')) then
      if @q[:field_exam] == 'patient' then
        # Patient.name (String)
        @result = Exam.joins(:patient).where("lower(patients.name) LIKE ?", "%#{@q[:field_value]}%".downcase)
      else
        # ID
        @result = Exam.where("#{@q[:field_exam]} = ?", @q[:field_value].to_i)
---
SELECT `patients`.* FROM `patients` WHERE (date_birth = '1990-01-01')
SELECT `exams`.* FROM `exams` WHERE (point_n = 632)
SELECT `exams`.* FROM `exams` INNER JOIN `patients` ON `patients`.`id` = `exams`.`patient_id` WHERE (lower(patients.name) LIKE '%8%')
SELECT `exams`.* FROM `exams` WHERE `exams`.`patient_id` = 2