app/controllers/types_exams_controller.rb

  def index
    @types_exams = TypesExam.all.order(name: :desc)
---
SELECT `types_exams`.* FROM `types_exams` ORDER BY `types_exams`.`name` DESC

  def create
    @types_exam = TypesExam.new(types_exam_params)

    respond_to do |format|
      if @types_exam.save
---
INSERT INTO `types_exams` (`name`, `active`, `slug`, `created_at`, `updated_at`) VALUES ('Stella Mooney', TRUE, 'stella-mooney', '2019-06-29 01:02:51', '2019-06-29 01:02:51')

  def update
    respond_to do |format|
      if @types_exam.update(types_exam_params)
---
UPDATE `exams` SET `exams`.`types_exam_id` = NULL WHERE `exams`.`types_exam_id` = 1
UPDATE `types_exams` SET `active` = FALSE, `updated_at` = '2019-06-25 03:24:03' WHERE `types_exams`.`id` = 1

  def destroy
    @types_exam.destroy
---
DELETE FROM `types_exams` WHERE `types_exams`.`id` = 1

    def set_types_exam
      @types_exam = TypesExam.friendly.find(params[:id])
---
SELECT  `types_exams`.* FROM `types_exams` WHERE `types_exams`.`id` = 1 LIMIT 1