app/views/exams/_exam.json.jbuilder

json.id exam.id
json.types_exam (exam.types_exam.present? ? exam.types_exam.name : "N/A")
---
SELECT `exams`.* FROM `exams` ORDER BY `exams`.`id` DESC