app/views/exams/destroy.js.erb

$('.delete-exam').bind('ajax:success', function() {
  $(this).closest('tr').fadeOut('slow');
});
---
DELETE FROM `exams` WHERE `exams`.`id` = 11