app/views/exams/index.html.erb

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1
SELECT `exams`.* FROM `exams` ORDER BY `exams`.`id` DESC
---
        <td><%= link_to exam.id.to_s, exam %></td>
        <td><%= link_to exam.patient.name, exam if exam.patient.present? %></td>
        <td><%= link_to (exam.types_exam.present? ? exam.types_exam.name : "N/A"), exam %></td>