app/views/exams/show.html.erb

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 2 LIMIT 1
---
    <strong>Patient:</strong>
    <%= @exam.patient.name if @exam.patient.present? -%>